{"class_name": "Model", "config": {"name": "model_24", "layers": [{"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 295], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "dense_139", "class_name": "Dense", "config": {"name": "dense_139", "trainable": true, "batch_input_shape": [null, 295], "dtype": "float32", "units": 450, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"name": "p_re_lu_70", "class_name": "PReLU", "config": {"name": "p_re_lu_70", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_139", 0, 0, {}]]]}, {"name": "batch_normalization_70", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_70", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_70", 0, 0, {}]]]}, {"name": "dropout_70", "class_name": "Dropout", "config": {"name": "dropout_70", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_70", 0, 0, {}]]]}, {"name": "gaussian_noise_70", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_70", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_70", 0, 0, {}]]]}, {"name": "concatenate_70", "class_name": "Concatenate", "config": {"name": "concatenate_70", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_24", 0, 0, {}], ["gaussian_noise_70", 0, 0, {}]]]}, {"name": "dense_140", "class_name": "Dense", "config": {"name": "dense_140", "trainable": true, "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_70", 0, 0, {}]]]}, {"name": "p_re_lu_71", "class_name": "PReLU", "config": {"name": "p_re_lu_71", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_140", 0, 0, {}]]]}, {"name": "batch_normalization_71", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_71", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_71", 0, 0, {}]]]}, {"name": "dropout_71", "class_name": "Dropout", "config": {"name": "dropout_71", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_71", 0, 0, {}]]]}, {"name": "gaussian_noise_71", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_71", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_71", 0, 0, {}]]]}, {"name": "concatenate_71", "class_name": "Concatenate", "config": {"name": "concatenate_71", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_70", 0, 0, {}], ["gaussian_noise_71", 0, 0, {}]]]}, {"name": "dense_141", "class_name": "Dense", "config": {"name": "dense_141", "trainable": true, "units": 400, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_71", 0, 0, {}]]]}, {"name": "p_re_lu_72", "class_name": "PReLU", "config": {"name": "p_re_lu_72", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_141", 0, 0, {}]]]}, {"name": "batch_normalization_72", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_72", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_72", 0, 0, {}]]]}, {"name": "dropout_72", "class_name": "Dropout", "config": {"name": "dropout_72", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_72", 0, 0, {}]]]}, {"name": "gaussian_noise_72", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_72", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_72", 0, 0, {}]]]}, {"name": "concatenate_72", "class_name": "Concatenate", "config": {"name": "concatenate_72", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_71", 0, 0, {}], ["gaussian_noise_72", 0, 0, {}]]]}, {"name": "dense_142", "class_name": "Dense", "config": {"name": "dense_142", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_72", 0, 0, {}]]]}, {"name": "dense_143", "class_name": "Dense", "config": {"name": "dense_143", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_142", 0, 0, {}]]]}, {"name": "dense_144", "class_name": "Dense", "config": {"name": "dense_144", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_143", 0, 0, {}]]]}], "input_layers": [["input_24", 0, 0]], "output_layers": [["dense_144", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}