{"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 295], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "dense_133", "class_name": "Dense", "config": {"name": "dense_133", "trainable": true, "batch_input_shape": [null, 295], "dtype": "float32", "units": 450, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "p_re_lu_67", "class_name": "PReLU", "config": {"name": "p_re_lu_67", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_133", 0, 0, {}]]]}, {"name": "batch_normalization_67", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_67", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_67", 0, 0, {}]]]}, {"name": "dropout_67", "class_name": "Dropout", "config": {"name": "dropout_67", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]}, {"name": "gaussian_noise_67", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_67", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_67", 0, 0, {}]]]}, {"name": "concatenate_67", "class_name": "Concatenate", "config": {"name": "concatenate_67", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_23", 0, 0, {}], ["gaussian_noise_67", 0, 0, {}]]]}, {"name": "dense_134", "class_name": "Dense", "config": {"name": "dense_134", "trainable": true, "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_67", 0, 0, {}]]]}, {"name": "p_re_lu_68", "class_name": "PReLU", "config": {"name": "p_re_lu_68", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_134", 0, 0, {}]]]}, {"name": "batch_normalization_68", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_68", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_68", 0, 0, {}]]]}, {"name": "dropout_68", "class_name": "Dropout", "config": {"name": "dropout_68", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]}, {"name": "gaussian_noise_68", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_68", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_68", 0, 0, {}]]]}, {"name": "concatenate_68", "class_name": "Concatenate", "config": {"name": "concatenate_68", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_67", 0, 0, {}], ["gaussian_noise_68", 0, 0, {}]]]}, {"name": "dense_135", "class_name": "Dense", "config": {"name": "dense_135", "trainable": true, "units": 400, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_68", 0, 0, {}]]]}, {"name": "p_re_lu_69", "class_name": "PReLU", "config": {"name": "p_re_lu_69", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_135", 0, 0, {}]]]}, {"name": "batch_normalization_69", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_69", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_69", 0, 0, {}]]]}, {"name": "dropout_69", "class_name": "Dropout", "config": {"name": "dropout_69", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]]}, {"name": "gaussian_noise_69", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_69", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_69", 0, 0, {}]]]}, {"name": "concatenate_69", "class_name": "Concatenate", "config": {"name": "concatenate_69", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_68", 0, 0, {}], ["gaussian_noise_69", 0, 0, {}]]]}, {"name": "dense_136", "class_name": "Dense", "config": {"name": "dense_136", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_69", 0, 0, {}]]]}, {"name": "dense_137", "class_name": "Dense", "config": {"name": "dense_137", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_136", 0, 0, {}]]]}, {"name": "dense_138", "class_name": "Dense", "config": {"name": "dense_138", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_137", 0, 0, {}]]]}], "input_layers": [["input_23", 0, 0]], "output_layers": [["dense_138", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}