{"class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 295], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "dense_97", "class_name": "Dense", "config": {"name": "dense_97", "trainable": true, "batch_input_shape": [null, 295], "dtype": "float32", "units": 450, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "p_re_lu_49", "class_name": "PReLU", "config": {"name": "p_re_lu_49", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_97", 0, 0, {}]]]}, {"name": "batch_normalization_49", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_49", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_49", 0, 0, {}]]]}, {"name": "dropout_49", "class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_49", 0, 0, {}]]]}, {"name": "gaussian_noise_49", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_49", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"name": "concatenate_49", "class_name": "Concatenate", "config": {"name": "concatenate_49", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_17", 0, 0, {}], ["gaussian_noise_49", 0, 0, {}]]]}, {"name": "dense_98", "class_name": "Dense", "config": {"name": "dense_98", "trainable": true, "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_49", 0, 0, {}]]]}, {"name": "p_re_lu_50", "class_name": "PReLU", "config": {"name": "p_re_lu_50", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_98", 0, 0, {}]]]}, {"name": "batch_normalization_50", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_50", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_50", 0, 0, {}]]]}, {"name": "dropout_50", "class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_50", 0, 0, {}]]]}, {"name": "gaussian_noise_50", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_50", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_50", 0, 0, {}]]]}, {"name": "concatenate_50", "class_name": "Concatenate", "config": {"name": "concatenate_50", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_49", 0, 0, {}], ["gaussian_noise_50", 0, 0, {}]]]}, {"name": "dense_99", "class_name": "Dense", "config": {"name": "dense_99", "trainable": true, "units": 400, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_50", 0, 0, {}]]]}, {"name": "p_re_lu_51", "class_name": "PReLU", "config": {"name": "p_re_lu_51", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_99", 0, 0, {}]]]}, {"name": "batch_normalization_51", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_51", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_51", 0, 0, {}]]]}, {"name": "dropout_51", "class_name": "Dropout", "config": {"name": "dropout_51", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_51", 0, 0, {}]]]}, {"name": "gaussian_noise_51", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_51", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_51", 0, 0, {}]]]}, {"name": "concatenate_51", "class_name": "Concatenate", "config": {"name": "concatenate_51", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_50", 0, 0, {}], ["gaussian_noise_51", 0, 0, {}]]]}, {"name": "dense_100", "class_name": "Dense", "config": {"name": "dense_100", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_51", 0, 0, {}]]]}, {"name": "dense_101", "class_name": "Dense", "config": {"name": "dense_101", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_100", 0, 0, {}]]]}, {"name": "dense_102", "class_name": "Dense", "config": {"name": "dense_102", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_101", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0]], "output_layers": [["dense_102", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}