{"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 295], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "dense_145", "class_name": "Dense", "config": {"name": "dense_145", "trainable": true, "batch_input_shape": [null, 295], "dtype": "float32", "units": 450, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "p_re_lu_73", "class_name": "PReLU", "config": {"name": "p_re_lu_73", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_145", 0, 0, {}]]]}, {"name": "batch_normalization_73", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_73", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_73", 0, 0, {}]]]}, {"name": "dropout_73", "class_name": "Dropout", "config": {"name": "dropout_73", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_73", 0, 0, {}]]]}, {"name": "gaussian_noise_73", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_73", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_73", 0, 0, {}]]]}, {"name": "concatenate_73", "class_name": "Concatenate", "config": {"name": "concatenate_73", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_25", 0, 0, {}], ["gaussian_noise_73", 0, 0, {}]]]}, {"name": "dense_146", "class_name": "Dense", "config": {"name": "dense_146", "trainable": true, "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_73", 0, 0, {}]]]}, {"name": "p_re_lu_74", "class_name": "PReLU", "config": {"name": "p_re_lu_74", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_146", 0, 0, {}]]]}, {"name": "batch_normalization_74", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_74", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_74", 0, 0, {}]]]}, {"name": "dropout_74", "class_name": "Dropout", "config": {"name": "dropout_74", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_74", 0, 0, {}]]]}, {"name": "gaussian_noise_74", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_74", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_74", 0, 0, {}]]]}, {"name": "concatenate_74", "class_name": "Concatenate", "config": {"name": "concatenate_74", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_73", 0, 0, {}], ["gaussian_noise_74", 0, 0, {}]]]}, {"name": "dense_147", "class_name": "Dense", "config": {"name": "dense_147", "trainable": true, "units": 400, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_74", 0, 0, {}]]]}, {"name": "p_re_lu_75", "class_name": "PReLU", "config": {"name": "p_re_lu_75", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_147", 0, 0, {}]]]}, {"name": "batch_normalization_75", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_75", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_75", 0, 0, {}]]]}, {"name": "dropout_75", "class_name": "Dropout", "config": {"name": "dropout_75", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_75", 0, 0, {}]]]}, {"name": "gaussian_noise_75", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_75", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_75", 0, 0, {}]]]}, {"name": "concatenate_75", "class_name": "Concatenate", "config": {"name": "concatenate_75", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_74", 0, 0, {}], ["gaussian_noise_75", 0, 0, {}]]]}, {"name": "dense_148", "class_name": "Dense", "config": {"name": "dense_148", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_75", 0, 0, {}]]]}, {"name": "dense_149", "class_name": "Dense", "config": {"name": "dense_149", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_148", 0, 0, {}]]]}, {"name": "dense_150", "class_name": "Dense", "config": {"name": "dense_150", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_149", 0, 0, {}]]]}], "input_layers": [["input_25", 0, 0]], "output_layers": [["dense_150", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}