{"class_name": "Model", "config": {"name": "model_22", "layers": [{"name": "input_22", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 295], "dtype": "float32", "sparse": false, "name": "input_22"}, "inbound_nodes": []}, {"name": "dense_127", "class_name": "Dense", "config": {"name": "dense_127", "trainable": true, "batch_input_shape": [null, 295], "dtype": "float32", "units": 450, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_22", 0, 0, {}]]]}, {"name": "p_re_lu_64", "class_name": "PReLU", "config": {"name": "p_re_lu_64", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_127", 0, 0, {}]]]}, {"name": "batch_normalization_64", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_64", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_64", 0, 0, {}]]]}, {"name": "dropout_64", "class_name": "Dropout", "config": {"name": "dropout_64", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]]}, {"name": "gaussian_noise_64", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_64", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_64", 0, 0, {}]]]}, {"name": "concatenate_64", "class_name": "Concatenate", "config": {"name": "concatenate_64", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_22", 0, 0, {}], ["gaussian_noise_64", 0, 0, {}]]]}, {"name": "dense_128", "class_name": "Dense", "config": {"name": "dense_128", "trainable": true, "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_64", 0, 0, {}]]]}, {"name": "p_re_lu_65", "class_name": "PReLU", "config": {"name": "p_re_lu_65", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_128", 0, 0, {}]]]}, {"name": "batch_normalization_65", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_65", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_65", 0, 0, {}]]]}, {"name": "dropout_65", "class_name": "Dropout", "config": {"name": "dropout_65", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]]}, {"name": "gaussian_noise_65", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_65", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_65", 0, 0, {}]]]}, {"name": "concatenate_65", "class_name": "Concatenate", "config": {"name": "concatenate_65", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_64", 0, 0, {}], ["gaussian_noise_65", 0, 0, {}]]]}, {"name": "dense_129", "class_name": "Dense", "config": {"name": "dense_129", "trainable": true, "units": 400, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_65", 0, 0, {}]]]}, {"name": "p_re_lu_66", "class_name": "PReLU", "config": {"name": "p_re_lu_66", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_129", 0, 0, {}]]]}, {"name": "batch_normalization_66", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_66", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_66", 0, 0, {}]]]}, {"name": "dropout_66", "class_name": "Dropout", "config": {"name": "dropout_66", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]]}, {"name": "gaussian_noise_66", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_66", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_66", 0, 0, {}]]]}, {"name": "concatenate_66", "class_name": "Concatenate", "config": {"name": "concatenate_66", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_65", 0, 0, {}], ["gaussian_noise_66", 0, 0, {}]]]}, {"name": "dense_130", "class_name": "Dense", "config": {"name": "dense_130", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_66", 0, 0, {}]]]}, {"name": "dense_131", "class_name": "Dense", "config": {"name": "dense_131", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_130", 0, 0, {}]]]}, {"name": "dense_132", "class_name": "Dense", "config": {"name": "dense_132", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_131", 0, 0, {}]]]}], "input_layers": [["input_22", 0, 0]], "output_layers": [["dense_132", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}