{"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 295], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "dense_79", "class_name": "Dense", "config": {"name": "dense_79", "trainable": true, "batch_input_shape": [null, 295], "dtype": "float32", "units": 450, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "p_re_lu_40", "class_name": "PReLU", "config": {"name": "p_re_lu_40", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_79", 0, 0, {}]]]}, {"name": "batch_normalization_40", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_40", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_40", 0, 0, {}]]]}, {"name": "dropout_40", "class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]]}, {"name": "gaussian_noise_40", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_40", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"name": "concatenate_40", "class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_14", 0, 0, {}], ["gaussian_noise_40", 0, 0, {}]]]}, {"name": "dense_80", "class_name": "Dense", "config": {"name": "dense_80", "trainable": true, "units": 600, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"name": "p_re_lu_41", "class_name": "PReLU", "config": {"name": "p_re_lu_41", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_80", 0, 0, {}]]]}, {"name": "batch_normalization_41", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_41", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_41", 0, 0, {}]]]}, {"name": "dropout_41", "class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]]}, {"name": "gaussian_noise_41", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_41", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_41", 0, 0, {}]]]}, {"name": "concatenate_41", "class_name": "Concatenate", "config": {"name": "concatenate_41", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_40", 0, 0, {}], ["gaussian_noise_41", 0, 0, {}]]]}, {"name": "dense_81", "class_name": "Dense", "config": {"name": "dense_81", "trainable": true, "units": 400, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_41", 0, 0, {}]]]}, {"name": "p_re_lu_42", "class_name": "PReLU", "config": {"name": "p_re_lu_42", "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null}, "inbound_nodes": [[["dense_81", 0, 0, {}]]]}, {"name": "batch_normalization_42", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_42", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["p_re_lu_42", 0, 0, {}]]]}, {"name": "dropout_42", "class_name": "Dropout", "config": {"name": "dropout_42", "trainable": true, "rate": 0.45, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]]}, {"name": "gaussian_noise_42", "class_name": "GaussianNoise", "config": {"name": "gaussian_noise_42", "trainable": true, "stddev": 0.15}, "inbound_nodes": [[["dropout_42", 0, 0, {}]]]}, {"name": "concatenate_42", "class_name": "Concatenate", "config": {"name": "concatenate_42", "trainable": true, "axis": -1}, "inbound_nodes": [[["concatenate_41", 0, 0, {}], ["gaussian_noise_42", 0, 0, {}]]]}, {"name": "dense_82", "class_name": "Dense", "config": {"name": "dense_82", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_42", 0, 0, {}]]]}, {"name": "dense_83", "class_name": "Dense", "config": {"name": "dense_83", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_82", 0, 0, {}]]]}, {"name": "dense_84", "class_name": "Dense", "config": {"name": "dense_84", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_83", 0, 0, {}]]]}], "input_layers": [["input_14", 0, 0]], "output_layers": [["dense_84", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}